package com.mj.bcalendar.activity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.view.WindowManager;
import android.widget.Button;
import android.widget.TextView;
import androidx.appcompat.app.AppCompatActivity;
import com.mj.bcalendar.BuildConfig;
import com.mj.bcalendar.R;

public class LoginActivity extends AppCompatActivity {

	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// 화면 초기화 부분
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	@Override
	protected void onCreate(Bundle savedInstanceState) {
		super.onCreate(savedInstanceState);
		getWindow().setFlags(WindowManager.LayoutParams.FLAG_FULLSCREEN,
			WindowManager.LayoutParams.FLAG_FULLSCREEN);
		this.initView();
		this.setListener();

		setTxtVersion();
	}

	/**
	* Function Description
	* 디자인 쪽 객체  초기화
	**/
	private void initView(){
		setContentView(R.layout.activity_login);
		txtVersion = findViewById(R.id.txtVersion);
		btnLogin = findViewById(R.id.btnLogin);
	}

	private void setListener(){
		btnLogin.setOnClickListener(new View.OnClickListener(){
			@Override
			public void onClick(View view){
				successLogin();
			}
		});
	}

	/*****************************************************************************************************************************/
	//  화면 초기화 마지막 부분
	/*****************************************************************************************************************************/

	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Version 관련 기록하기
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	private TextView txtVersion;

	/**
	* Function Description
	*  로그인 화면에서 현재 어플의 버전을 나타내기 위한  함수
	**/
	private void setTxtVersion(){
		txtVersion.setText(txtVersion.getText() + " " + BuildConfig.VERSION_NAME + " ");
	}
	/*****************************************************************************************************************************/
	// Version 관련 기록하기 마지막 부분
	/*****************************************************************************************************************************/

	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// 로그인 기능 구현
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	// TODO: 2020-03-20 서버에서 로그인 정보 받아와서 확인하기
	private Button btnLogin;

	/*****************************************************************************************************************************/
	// 로그인 기능 구현 마지막 부분
	/*****************************************************************************************************************************/

	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// 메인 화면 전환
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	private void successLogin(){
		Intent mainIntent = new Intent(LoginActivity.this, MainActivity.class);

		startActivity(mainIntent);
	}
	/*****************************************************************************************************************************/
	// 메인 화면 전환 마지막 부분
	/*****************************************************************************************************************************/
}
